app/controllers/api/v1/articles/article_helpers_controller.rb

  def popular_articles
    popular_articles = Article.joins(:favorites).select("count(articles.id) as count_order, articles.*").group(:article_id).order("count_order desc")
---
SELECT count(articles.id) as count_order, articles.* FROM `articles` INNER JOIN `favorites` ON `favorites`.`article_id` = `articles`.`id` AND `favorites`.`deleted_at` IS NULL WHERE `articles`.`deleted_at` IS NULL GROUP BY `article_id` ORDER BY count_order desc