app/controllers/api/v1/articles/article_helpers_controller.rb

SELECT COUNT(*) AS count_all, `favorites`.`article_id` AS favorites_article_id FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL GROUP BY `favorites`.`article_id`
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL AND `favorites`.`article_id` = 2
---
  def popular_articles
    popular_articles = Article.where id: Favorite.group(:article_id).count.keys.slice(0..2)

SELECT  `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`id` = 1 LIMIT 1
---
  def articles_by_user
    user = User.friendly.find params[:id]