app/controllers/api/v1/articles_controller.rb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`deleted_at` IS NULL AND `comments`.`article_id` = 1
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL AND `favorites`.`article_id` = 1
---
    def index
      # users = User.where(id: current_user.following.select(:id))
      if params[:article_length].to_i == Article.all.size
        message = {message: "No more articles", status: 204}
        render json: message
      else
        articles = Article.includes(:images, :user, :comments, :favorites,
          :categories).order(created_at: :desc)
          .offset(params[:article_length]).limit(params[:limit])