app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`deleted_at` IS NULL
SELECT `categories`.* FROM `categories` INNER JOIN `categories_articles` ON `categories`.`id` = `categories_articles`.`category_id` WHERE `categories`.`deleted_at` IS NULL AND `categories_articles`.`deleted_at` IS NULL AND `categories_articles`.`article_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`deleted_at` IS NULL AND `comments`.`article_id` IN (5, 6, 7, 8, 9, 10)
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL AND `favorites`.`article_id` IN (5, 6, 7, 8, 9, 10)
---
    def index
      articles = Article.all.includes :images, :user, :comments, :favorites,
        :categories

SELECT  `articles`.* FROM `articles` WHERE `articles`.`deleted_at` IS NULL AND `articles`.`id` = 1 LIMIT 1
---
    def show
      article = Article.friendly.find params[:id]

INSERT INTO `articles` (`title`, `description`, `content`, `user_id`, `slug`, `created_at`, `updated_at`) VALUES ('new title 1', 'descript', '123123 asdasd', 1, 'new-title-1', '2017-05-24 07:01:51', '2017-05-24 07:01:51')
INSERT INTO `images` (`picture`, `article_id`, `created_at`, `updated_at`) VALUES ('Screenshot_from_2017-03-27_21_43_52.png', 8, '2017-05-19 07:41:20', '2017-05-19 07:41:20')
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('[\"tag1\", \" tag2\", \" tag3\"]', '2017-05-26 03:05:49', '2017-05-26 03:05:49')
SELECT `tags`.`id` FROM `tags` WHERE `tags`.`deleted_at` IS NULL AND `tags`.`name` IN ('tag1', 'tag2', 'tag3')
SELECT `tags_articles`.* FROM `tags_articles` WHERE `tags_articles`.`name` IN ('tag1', ' tag2', ' tag3')
---
    def create
      ActiveRecord::Base.transaction do
        article = current_user.articles.build title: params[:title], description: params[:description], content: params[:content]
        article.images.build picture: params[:picture]
        article.save
        tags = params[:tag].delete(" \/()!@{}$%^&*#[]|;:'").split(",")
        tags.each do |tag|
          Tag.find_or_create_by name: tag
        end
        tag_ids = Tag.select(:id).where name: tags
        article.tags_articles.create! tag_ids.map{|tag_id| {tag_id: tag_id.id}}

UPDATE `articles` SET `title` = 'new title', `description` = 'this is description', `content` = 'this is content', `updated_at` = '2017-05-23 03:25:35' WHERE `articles`.`id` = 1
---
    def update
      @article.update_attributes article_params