app/controllers/api/v1/categories_controller.rb

  def index
    categories = Category.all
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`deleted_at` IS NULL

  def show
    category = Category.find_by id: params[:id]
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`deleted_at` IS NULL AND `categories`.`id` = 1 LIMIT 1

  def create
    category = Category.create! name: params[:category][:name]
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('category 6', '2017-05-23 03:01:47', '2017-05-23 03:01:47')

  def update
    @category.update_columns name: params[:category][:name]
---
UPDATE `categories` SET `categories`.`name` = 'category 7' WHERE `categories`.`id` = 1