app/controllers/api/v1/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`deleted_at` IS NULL AND `articles`.`id` = 18 LIMIT 1
---
    def index
      article = Article.find_by id: params[:article_id]

INSERT INTO `comments` (`content`, `user_id`, `article_id`, `created_at`, `updated_at`) VALUES ('comment content', 3, 3, '2017-05-16 03:30:06', '2017-05-16 03:30:06')
---
    def create
      comment = current_user.comments.build content: params[:comment][:content],
        article_id: params[:article_id]
      comment.save

UPDATE `comments` SET `content` = 'comment content 1', `updated_at` = '2017-05-16 03:54:18' WHERE `comments`.`id` = 4
---
    def update
      @comment.update_attributes content: params[:comment][:content]

DELETE FROM `comments` WHERE `comments`.`id` = 1
---
    def destroy
      @comment.destroy