app/controllers/api/v1/contacts_controller.rb

  def create
    contact = Contact.create contact_params
---
INSERT INTO `contacts` (`username`, `email`, `content`, `created_at`, `updated_at`) VALUES ('le van tho', 'lvtho129@gmail.com', 'test send contact', '2017-05-16 04:28:50', '2017-05-16 04:28:50')