app/controllers/api/v1/favorites_controller.rb

  def create
    favorite = current_user.favorites.build article_id: params[:article_id]
    favorite.save
---
INSERT INTO `favorites` (`user_id`, `article_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-05-23 04:34:07', '2017-05-23 04:34:07')

  def destroy
    favorite = Favorite.find_by user_id: current_user.id,
      article_id: params[:article_id]
---
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL AND `favorites`.`user_id` = 1 AND `favorites`.`article_id` = 1 LIMIT 1