app/controllers/api/v1/favorites_controller.rb

SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`deleted_at` IS NULL AND `favorites`.`id` = 1 LIMIT 1
---
  def destroy
    current_user.favorites.find_by!(id: params[:id]).destroy