app/controllers/api/v1/relationships_controller.rb

  def create
    Relationship.create! follower_id: current_user.id, followed_id: params[:user_id]
---
INSERT INTO `relationships` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (1, 2, '2017-06-01 07:14:45', '2017-06-01 07:14:45')

  def destroy
    relationship = Relationship.find_by follower_id: current_user.id, followed_id: params[:id]
---
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`deleted_at` IS NULL AND `relationships`.`follower_id` = 1 AND `relationships`.`followed_id` = 2 LIMIT 1