app/controllers/api/v1/sessions_controller.rb

    def create
      user = User.find_by email: params[:email]
      if user && user.authenticate(params[:password])
        user.update_columns auth_token: SecureRandom.hex
---
SELECT  `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`email` = 'lvtho129@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`auth_token` = '07fa6faff20119695ea41380a26d6ec2' WHERE `users`.`id` = 1

    def destroy
      user = User.find_by id: params[:id]
      unless user
        error = {error: {message: "User not found", status: 404}}
        render json: error
      else
        user.update_columns(auth_token: nil) if user.auth_token == response.request.env['HTTP_AUTH_TOKEN']
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`auth_token` = NULL WHERE `users`.`id` = 1