app/controllers/api/v1/users_controller.rb

    def create
      user = User.new user_params
      if user.valid?
        user.save
---
INSERT INTO `users` (`username`, `email`, `password_digest`, `phone`, `address`, `slug`, `created_at`, `updated_at`, `avatar`) VALUES ('Crystel', 'katelin@yahoo.com', '$2a$04$GSGMPEtjlajPAIgqRn14XuQFYXJ./aSCstRPpDMZHA.pfPeduon.W', 123456789, 'asdsad 123', 'crystel', '2017-06-07 04:51:37', '2017-06-07 04:51:37', NULL)

    def show
      begin
        user = User.friendly.find params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`id` = 1 LIMIT 1